angular.module('plagend.controllers', ['ui.grid','ui.grid.edit'])
    .config(function($datepickerProvider) {
        angular.extend($datepickerProvider.defaults, {
            dateFormat: 'yyyy年MM月dd日',
            startWeek: 1
        });
    })
    .controller('DeductCtrl', ['$scope', '$http', '$alert', function($scope, $http, $alert) {
        $scope.schema = {};
        $scope.values = [100, 200, 300, 400, 500, 1000];
        var now = new Date();
        $scope.schema.fromDate = now;
        $scope.schema.untilDate = now;
        $scope.reset = function() {
            $scope.schema = {};
        }
        $scope.submit = function() {
            var f = $scope.schema.fromDate;
            var u = $scope.schema.untilDate;
            $scope.schema.fromDate = transfer(f);
            $scope.schema.untilDate = transfer(u);
            $http({
                method: 'POST',
                data: $.param($scope.schema),
                url: 'commission-schema',
                headers: {
                    'Content-Type': 'application/x-www-form-urlencoded' // set the headers so angular passing info as form data (not request payload)
                }
            }).then(function successCallback(resp) {
                $alert({
                    title: '信息提示:',
                    content: resp.data.msg,
                    placement: 'top',
                    duration: 3,
                    type: 'info',
                    show: true
                });
                console.log(resp);
                $scope.reset();
            }, function errorCallback() {});
        }

        function transfer(now) {
            return now.getFullYear() + "-" + (now.getMonth() + 1) + "-" + now.getDate();
        }
    }])
    .controller('ProductCtrl', function($scope) {
        $scope.model = "Hello WORLD!";
    })
    .controller('LoginCtrl', function($scope) {
        $scope.reset = function() {
            $scope.username = "";
            $scope.password = "";
        }
    })
    .controller('MemberCtrl', ['$scope', function($scope) {
        $scope.gridOptions = {
            columnDefs: [{
                field: '分销商手机号'
            }, {
                field: '分销商姓名'
            }, {
                field: '辖区编号',
                enableCellEdit:true
            }, {
                field: '辖区名称'
            }]
        };
        $scope.myData = [{
            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {
            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }, {

            "分销商手机号": "13333333333",
            "分销商姓名": "Bran Stark",
            "辖区编号": "1001",
            "辖区名称": "金水区"
        }];
        $scope.gridOptions.data = $scope.myData;
    }])
